In [1]:
# import dependencies
import os
import pandas as pd
from password import username, password
from sqlalchemy import create_engine, inspect
from sqlalchemy_utils import database_exists, create_database

In [2]:
# create engine and database
engine = create_engine('postgresql://'+username+':'+password+'@localhost/country_happyCOL')
if not database_exists(engine.url):
    create_database(engine.url)

In [3]:
# set csv import path
countrypath=os.path.join('02_transform_country','country.csv')
happypath=os.path.join('02_transform_happiness','happy_data.csv')
colipath=os.path.join('02_transform_coli','coli_data.csv')
propertypath=os.path.join('02_transform_coli','property_data.csv')

In [4]:
# import country data
countrydata=pd.read_csv(countrypath)
countrydata.head()

  countrycode         country   continent
0         AFG     Afghanistan        Asia
1         ALB         Albania      Europe
2         ATA      Antarctica  Antarctica
3         DZA         Algeria      Africa
4         ASM  American Samoa     Oceania

In [5]:
# create year table
yeardata=pd.DataFrame({"year":["2015","2016","2017","2018","2019"]})
yeardata

   year
0  2015
1  2016
2  2017
3  2018
4  2019

In [6]:
# import happiness data
happydata=pd.read_csv(happypath)
happydata.head()

,year,countrycode,happyrank,happyscore,economy,social,health,freedom,generosity,trust
0,2015,CHE,1,7.587,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678
1,2015,ISL,2,7.561,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630
2,2015,DNK,3,7.527,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139
3,2015,NOR,4,7.522,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699
4,2015,CAN,5,7.427,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811

In [7]:
# import COLI data
colidata=pd.read_csv(colipath)
colidata.head()

,countrycode,year,ranking,costofliving_index,rent_index,groceries_index,restaurantprice_index,localpurchpower_index
0,CHE,2015,1,126.03,57.63,128.44,127.64,146.51
1,NOR,2015,2,118.59,48.70,110.06,141.45,96.30
2,VEN,2015,3,111.01,34.13,128.43,91.09,11.90
3,ISL,2015,4,102.14,35.86,103.76,105.21,70.84
4,DNK,2015,5,100.60,34.71,88.59,117.53,105.70

In [8]:
# import property data
propertydata=pd.read_csv(propertypath)
propertydata.head()

,countrycode,year,price_income_ratio,mortage_income_ratio,affordability_index
0,UGA,2015,31.13,649.36,0.15
1,SYR,2015,30.49,283.67,0.35
2,HKG,2015,30.09,192.99,0.52
3,MMR,2015,26.84,317.96,0.31
4,GHA,2015,26.62,670.38,0.15

In [9]:
#drop table if exists
engine.execute("DROP TABLE IF EXISTS coli")
engine.execute("DROP TABLE IF EXISTS property")
engine.execute("DROP TABLE IF EXISTS happiness")
engine.execute("DROP TABLE IF EXISTS country")
engine.execute("DROP TABLE IF EXISTS year")

In [10]:
# create country table & constraints in SQL
engine.execute("CREATE TABLE country (\
                    countrycode CHAR(3) NOT NULL PRIMARY KEY,\
                    country VARCHAR(100) NOT NULL,\
                    continent VARCHAR(100) NOT NULL)")

In [11]:
# save country data into SQL database
countrydata.to_sql(name='country', con=engine, if_exists='append', index=False)

In [12]:
# create year table & constraints in SQL
engine.execute("CREATE TABLE year (year INT NOT NULL PRIMARY KEY)")

In [13]:
# save year data into SQL database
yeardata.to_sql(name='year', con=engine, if_exists='append', index=False)

In [14]:
# create happiness table & constraints in SQL
engine.execute("CREATE TABLE happiness (\
                    id SERIAL PRIMARY KEY,\
                    countrycode CHAR(3) NOT NULL,\
                    year INT NOT NULL,\
                    happyrank INT NOT NULL,\
                    happyscore DECIMAL NOT NULL,\
                    economy DECIMAL NOT NULL,\
                    social DECIMAL NOT NULL,\
                    health DECIMAL NOT NULL,\
                    freedom DECIMAL NOT NULL,\
                    generosity DECIMAL NOT NULL,\
                    trust DECIMAL NOT NULL,\
                    FOREIGN KEY (countrycode)\
                    REFERENCES country(countrycode),\
                    FOREIGN KEY (year)\
                    REFERENCES year(year))")

In [15]:
# save happiness data into SQL database
happydata.to_sql(name='happiness', con=engine, if_exists='append', index=False)

In [16]:
# create COLI table & constraints in SQL
engine.execute("CREATE TABLE coli (\
                    id SERIAL PRIMARY KEY,\
                    countrycode CHAR(3) NOT NULL,\
                    year INT NOT NULL,\
                    ranking INT NOT NULL,\
                    costofliving_index DECIMAL NOT NULL,\
                    rent_index DECIMAL NOT NULL,\
                    groceries_index DECIMAL NOT NULL,\
                    restaurantprice_index DECIMAL NOT NULL,\
                    localpurchpower_index DECIMAL NOT NULL,\
                    FOREIGN KEY (countrycode)\
                    REFERENCES country(countrycode),\
                    FOREIGN KEY (year)\
                    REFERENCES year(year))")

In [17]:
# save COLI data into SQL database
colidata.to_sql(name='coli', con=engine, if_exists='append', index=False)

In [18]:
# create property table & constraints in SQL
engine.execute("CREATE TABLE property (\
                    id SERIAL PRIMARY KEY,\
                    countrycode CHAR(3) NOT NULL,\
                    year INT NOT NULL,\
                    price_income_ratio DECIMAL NOT NULL,\
                    mortage_income_ratio DECIMAL NOT NULL,\
                    affordability_index DECIMAL NOT NULL,\
                    FOREIGN KEY (countrycode)\
                    REFERENCES country(countrycode),\
                    FOREIGN KEY (year)\
                    REFERENCES year(year))")

In [19]:
# save property data into SQL database
propertydata.to_sql(name='property', con=engine, if_exists='append', index=False)

In [20]:
# ensure that tables are in database
inspector = inspect(engine)
tables=inspector.get_table_names()
print(tables)

['country', 'happiness', 'year', 'coli', 'property']

In [21]:
# confirm each table exists in sql by querying it
for table in tables:
    query='select * from '+ table
    print(pd.read_sql_query(query, con=engine).head())

  countrycode         country   continent
0         AFG     Afghanistan        Asia
1         ALB         Albania      Europe
2         ATA      Antarctica  Antarctica
3         DZA         Algeria      Africa
4         ASM  American Samoa     Oceania
   id countrycode  year  happyrank  happyscore  economy   social   health  \
0   1         CHE  2015          1       7.587  1.39651  1.34951  0.94143
1   2         ISL  2015          2       7.561  1.30232  1.40223  0.94784
2   3         DNK  2015          3       7.527  1.32548  1.36058  0.87464
3   4         NOR  2015          4       7.522  1.45900  1.33095  0.88521
4   5         CAN  2015          5       7.427  1.32629  1.32261  0.90563

   freedom  generosity    trust
0  0.66557     0.41978  0.29678
1  0.62877     0.14145  0.43630
2  0.64938     0.48357  0.34139
3  0.66973     0.36503  0.34699
4  0.63297     0.32957  0.45811
   year
0  2015
1  2016
2  2017
3  2018
4  2019
   id countrycode  year  ranking  costofliving_index  rent_index  \
0   1         CHE  2015        1              126.03       57.63
1   2         NOR  2015        2              118.59       48.70
2   3         VEN  2015        3              111.01       34.13
3   4         ISL  2015        4              102.14       35.86
4   5         DNK  2015        5              100.60       34.71

   groceries_index  restaurantprice_index  localpurchpower_index
0           128.44                 127.64                 146.51
1           110.06                 141.45                  96.30
2           128.43                  91.09                  11.90
3           103.76                 105.21                  70.84
4            88.59                 117.53                 105.70
   id countrycode  year  price_income_ratio  mortage_income_ratio  \
0   1         UGA  2015               31.13                649.36
1   2         SYR  2015               30.49                283.67
2   3         HKG  2015               30.09                192.99
3   4         MMR  2015               26.84                317.96
4   5         GHA  2015               26.62                670.38

   affordability_index
0                 0.15
1                 0.35
2                 0.52
3                 0.31
4                 0.15